In [1]:
import numpy as np
import pandas as pd

### Importando os dados de um arquivo .csv

In [17]:
df = pd.read_csv('exemplo.csv')

In [18]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [19]:
df = df + 1

In [27]:
df

    A   B   C   D
0   0   2   4   6
1   8  10  12  14
2  16  18  20  22
3  24  26  28  30

### Exportando dados para um novo arquivo .csv

In [21]:
df.to_csv('exemplo.csv', sep=';', decimal=',')

### Importando dados de uma planilha do excel

In [24]:
df = pd.read_excel('exemplo.xlsx')

In [25]:
df

    A   B   C   D
0   0   2   4   6
1   8  10  12  14
2  16  18  20  22
3  24  26  28  30

### Exportando dados para um .xlsx

In [26]:
df.to_excel('exemplo2.xlsx', sheet_name='Aba1')

### Lendo dados de uma p√°gina html

In [28]:
df = pd.read_html('https://www.fdic.gov/bank/individual/failed/banklist.html')

In [29]:
type(df)

list

In [34]:
len(df)

1

In [36]:
df[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
1,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
2,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
3,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019"
4,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017"
...,...,...,...,...,...,...
554,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
555,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
556,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
557,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
558,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [37]:
df[0].head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
1,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
2,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
3,The Enloe State Bank,Cooper,TX,10716,"Legend Bank, N. A.","May 31, 2019"
4,Washington Federal Bank for Savings,Chicago,IL,30570,Royal Savings Bank,"December 15, 2017"

In [43]:
df[0][['Bank Name']]

                               Bank Name
0       City National Bank of New Jersey
1                          Resolute Bank
2                  Louisa Community Bank
3                   The Enloe State Bank
4    Washington Federal Bank for Savings
..                                   ...
554                   Superior Bank, FSB
555                  Malta National Bank
556      First Alliance Bank & Trust Co.
557    National State Bank of Metropolis
558                     Bank of Honolulu

[559 rows x 1 columns]